Cylinder-Case/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}
convertToMeters 1;
// VERTICES
// All in metres (convertToMeters = 1).
// The slab is z in [-0.5, 0.5], i.e. 1 m thick, but with 1 cell in z so it's
// effectively 2D. The empty BC on the front and back faces enforces that.
vertices
(
    // Pre-block: upstream rectangle, x in [-30, -10]
    (-30  -25   0.5)   //  0
    (-10  -25   0.5)   //  1
    (-10  -25  -0.5)   //  2
    (-30  -25  -0.5)   //  3
    (-30   25   0.5)   //  4
    (-10   25   0.5)   //  5
    (-10   25  -0.5)   //  6
    (-30   25  -0.5)   //  7

    // Obstacle block corners (inner box edge stays at x,y = +/- 10)
    ( 10  -25   0.5)   //  8
    ( 10  -25  -0.5)   //  9

    // Cylinder surface vertices (UNCHANGED, the inner geometry is fine)
    (-1.767766953  -1.767766953   0.5)   // 10
    ( 1.767766953  -1.767766953   0.5)   // 11
    ( 1.767766953  -1.767766953  -0.5)   // 12
    (-1.767766953  -1.767766953  -0.5)   // 13
    (-1.767766953   1.767766953   0.5)   // 14
    (-1.767766953   1.767766953  -0.5)   // 15
    ( 1.767766953   1.767766953   0.5)   // 16
    ( 1.767766953   1.767766953  -0.5)   // 17

    // Inner box top corners (x = 10, y = 25)
    ( 10   25   0.5)   // 18
    ( 10   25  -0.5)   // 19

    // Post-block: downstream rectangle, x in [10, 120]
    ( 120  -25   0.5)   // 20
    ( 120  -25  -0.5)   // 21
    ( 120   25   0.5)   // 22
    ( 120   25  -0.5)   // 23
);
edges
(
    // Cylinder surface arcs at z = +0.5 (front plane)
    arc 10 11 (   0  -2.5   0.5)
    arc 14 10 (-2.5     0   0.5)
    arc 14 16 (   0   2.5   0.5)
    arc 16 11 ( 2.5     0   0.5)

    // Cylinder surface arcs at z = -0.5 (back plane)
    arc 12 13 (   0  -2.5  -0.5)
    arc 15 13 (-2.5     0  -0.5)
    arc 15 17 (   0   2.5  -0.5)
    arc 17 12 ( 2.5     0  -0.5)
);
blocks
(
    // Pre-block: 20 wide × 50 tall, 60 cells in y to match O-grid
    hex ( 0  1  2  3   4  5  6  7) (160 1 60) simpleGrading (1 1 1)

    // Four O-grid blocks UNCHANGED
    hex ( 1  8  9  2  10 11 12 13) (60 1 60) simpleGrading (1 1 1)
    hex ( 1 10 13  2   5 14 15  6) (60 1 60) simpleGrading (1 1 1)
    hex (14 16 17 15   5 18 19  6) (60 1 60) simpleGrading (1 1 1)
    hex (11  8  9 12  16 18 19 17) (60 1 60) simpleGrading (1 1 1)

    // Post-block: 110 wide × 50 tall, 60 cells in y to match O-grid
    hex ( 8 20 21  9  18 22 23 19) (440 1 60) simpleGrading (3 1 1)
);
// PATCHES (boundary face groups)
boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)        // left face of pre-block
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (20 21 23 22)    // right face of post-block
        );
    }
    wall
    {
        // Top and bottom of the rectangular domain.
        // NOTE: patch is named "wall" but its TYPE is "symmetryPlane" in
        // constant/polyMesh/boundary. This is so the freestream is far-field-like
        // rather than channel-like. Plain no-slip walls here would impose a
        // confined channel flow.
        type symmetry;
        faces
        (
            // Top side (y = +10)
            (4 5 6 7)        // pre-block top
            (5 18 19 6)      // obstacle-region top strip
            (18 22 23 19)    // post-block top
            // Bottom side (y = -10)
            (0 1 2 3)        // pre-block bottom
            (1 8 9 2)        // obstacle-region bottom strip
            (8 20 21 9)      // post-block bottom
        );
    }
    obstacle
    {
        // The cylinder itself: the inner faces of the four O-grid blocks.
        type wall;
        faces
        (
            (10 11 12 13)    // bottom arc face
            (11 16 17 12)    // right arc face
            (14 16 17 15)    // top arc face
            (10 14 15 13)    // left arc face
        );
    }
    frontAndBack
    {
        // All z-min and z-max faces. Marking these "empty" tells OpenFOAM
        // "this is a 2D problem, don't solve in the z direction".
        type empty;
        faces
        (
            // z = +0.5 (front)
            (0 1 5 4)         // pre-block front
            (1 10 14 5)       // O-grid left strip front
            (14 16 18 5)      // O-grid top strip front
            (11 8 18 16)      // O-grid right strip front
            (1 8 11 10)       // O-grid bottom strip front
            (8 20 22 18)      // post-block front
            // z = -0.5 (back)
            (3 7 6 2)         // pre-block back
            (2 6 15 13)       // O-grid left strip back
            (15 6 19 17)      // O-grid top strip back
            (12 17 19 9)      // O-grid right strip back
            (2 13 12 9)       // O-grid bottom strip back
            (9 19 23 21)      // post-block back
        );
    }
);
mergePatchPairs ( );