Cylinder-Case/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          60;
        startFace       99960;
    }
    outlet
    {
        type            patch;
        nFaces          60;
        startFace       100020;
    }
    wall
    {
        type            symmetry;
        inGroups        1(symmetry);
        nFaces          1320;
        startFace       100080;
    }
    obstacle
    {
        type            wall;
        inGroups        1(wall);
        nFaces          240;
        startFace       101400;
    }
    frontAndBack
    {
        type            empty;
        inGroups        1(empty);
        nFaces          100800;
        startFace       101640;
    }
)

// ************************************************************************* //
