Cylinder-Case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
transportModel  Newtonian;
// Re = U * D / nu = 1.0 * 5.0 / 0.05 = 100  (clean 2D laminar vortex street regime)
nu              nu [0 2 -1 0 0 0 0] 0.05;
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
